#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Thu Nov  2 09:40:18 2023

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_16i_256O/fifo_16i_256O.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_256i_16O/fifo_256i_16O.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Frame/Frame_index.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Frame/fram_buf.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Frame/rd_buf.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Frame/wr_buf.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Projet/source/rtl/fram_buf.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Projet/source/rtl/rd_buf.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Projet/source/rtl/wr_buf.v"
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Frame/Frame_cnt.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/AXI_arbit/mem_write_arbi.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Projet/source/rtl/hdmi_ddr_ov5640_top.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/top/video_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module cmos_8_16bit
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/HDMI/de_frame.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/arp_cache.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/arp_mac_top.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/arp_rx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/arp_tx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/check_sum.vh"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/crc32_gen.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/eth_udp_test.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/ethernet_test.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/icmp.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/ip_layer.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/ip_rx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/ip_tx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/ip_tx_mode.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/mac_layer.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/mac_rx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/mac_tx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/mac_tx_mode.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/rgmii_interface.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/udp_ip_mac_top.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/udp_layer.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/udp_rx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/udp_rx_bac.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/udp_tx.v"
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/ref_clock/ref_clock.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/udp_shift/udp_shift.idf
remove_design -force F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/udp_shift/udp_shift.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/udp_shift_register/udp_shift_register.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/udp_rx_ram_8_2048/udp_rx_ram_8_2048.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/icmp_rx_ram_8_256/icmp_rx_ram_8_256.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_8I8O/fifo_8I8O.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/data_gen/udp_databus.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_8i_16o_14a/fifo_8i_16o_14a.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/arp/arp.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/arp/arp_rx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/arp/arp_tx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/arp/crc32_d8.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/eth_ctrl.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/eth_udp_loop.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/gmii_to_rgmii/gmii_to_rgmii.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/gmii_to_rgmii/rgmii_rx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/gmii_to_rgmii/rgmii_tx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/udp/udp.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/udp/udp_rx.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/new/udp/udp_tx.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/pll_200M/pll_200M.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_sync_32I32O/fifo_sync_32I32O.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
add_design "F:/Project/WorkSpace/FPGA/Video_pro/temp/Source/Mode_choice/mode_choice.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
remove_constraint  -logic -fdc "F:/Project/WorkSpace/FPGA/Video_pro/temp/Projet/hdmi_ddr_ov5640_top.fdc"
add_constraint "F:/Project/WorkSpace/FPGA/Video_pro/temp/Projet/constrain/video_top.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_design F:/Project/WorkSpace/FPGA/Video_pro/temp/Projet/ipcore/fifo_8I8O/fifo_8I8O.idf
remove_design F:/Project/WorkSpace/FPGA/Video_pro/temp/Projet/ipcore/udp_rx_ram_8_2048/udp_rx_ram_8_2048.idf
remove_design F:/Project/WorkSpace/FPGA/Video_pro/temp/Projet/source/rtl/wr_fram_buf/wr_fram_buf.idf
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
remove_design F:/Project/WorkSpace/FPGA/Video_pro/temp/Projet/source/rtl/rd_fram_buf/rd_fram_buf.idf
remove_design F:/Project/WorkSpace/FPGA/Video_pro/temp/Projet/ipcore/fifo_sync_32I32O/fifo_sync_32I32O.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Mode_choice/btn_deb_fix.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/rgb2ycbrcc/rgb2ycbcr.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/rgb2ycbrcc/vip.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/processor.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
pnr 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/line_shift_ram_8bit.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/median_filter_3x3.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/sort3.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/vip_gray_median_filter.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/vip_matrix_generate_3x3_8bit.v"
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/blk_mem_gen_0/blk_mem_gen_0.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/mean_filter/line_shift_ram_8bit.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/mean_filter/median_filter_3x3.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/mean_filter/sort3.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/mean_filter/vip_gray_median_filter.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/mean_filter/vip_matrix_generate_3x3_8bit.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/rgb2ycbrcc/rgb2ycbcr.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/rgb2ycbrcc/vip.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/processor.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/rgb2ycbrcc/rgb2ycbcr.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/rgb2ycbrcc/vip.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/processor.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/line_shift_ram_8bit.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/median_filter_3x3.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/sort3.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/vip_gray_median_filter.v"
remove_design -verilog "F:/Project/WorkSpace/FPGA/Video_pro/Source/Proseccor/mean_filter/vip_matrix_generate_3x3_8bit.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_16i_256o_2/fifo_16i_256o_2.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/calu.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/key_ctrl.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/para_change.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/scale_top.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/scaler.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/vin_scale_down.v"
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_4096x8/fifo_4096x8.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/ram_1024x8/ram_1024x8.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/ram_8i8o_2048/ram_8i8o_2048.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
remove_design -force F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_4096x8/fifo_4096x8.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_8i8o_4096/fifo_8i8o_4096.idf
remove_design -force F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_8i8o_4096/fifo_8i8o_4096.idf
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_8I8O_1/fifo_8I8O_1.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/HDMI/color_bar.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/AXI_arbit/mem_read_arbi.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/rd_scale.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/scale_ctr.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/scale/wr_scale.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/multiCamera_ctr/multiCamera_ctr.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design F:/Project/WorkSpace/FPGA/Video_pro/Projet/ipcore/fifo_16i_16o_2048/fifo_16i_16o_2048.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/UDP/data_gen/udp_char.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Frame/rd_char.v"
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Frame/wr_char.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
add_fic "F:/Project/WorkSpace/FPGA/Video_pro/Projet/synthesize/video_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
add_design "F:/Project/WorkSpace/FPGA/Video_pro/Source/Processor/brightness_contrast/brightness_contrast.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
